package project.enter.shedule;

import android.content.Intent;
import android.graphics.Color;
import android.net.Uri;
import android.os.Bundle;
import android.view.MenuItem;
import android.view.View;
import android.widget.TextView;
import android.widget.Toast;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;
import androidx.drawerlayout.widget.DrawerLayout;

import cn.pedant.SweetAlert.SweetAlertDialog;

public class History extends AppCompatActivity {

    TextView text;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_history);

        Toolbar toolbar =  findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);
        if (getSupportActionBar() != null){
            getSupportActionBar().setDisplayHomeAsUpEnabled(true);
            getSupportActionBar().setDisplayShowHomeEnabled(true);
        }
        historyNTU();

    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        // handle arrow click here
        if (item.getItemId() == android.R.id.home) {
            finish(); // close this activity and return to preview activity (if there is any)
        }

        return super.onOptionsItemSelected(item);
    }

     public void Back(View view) {
         Toast.makeText(this, "Back", Toast.LENGTH_SHORT).show();
     }


     public void Share(View view) {
         SweetAlertDialog sweetAlertDialog =  new SweetAlertDialog(this, SweetAlertDialog.WARNING_TYPE);
         sweetAlertDialog.setTitleText("Ви впевнені, що хочете перейти на сайт НТУ?");
         sweetAlertDialog.setCancelButton("Ні", new SweetAlertDialog.OnSweetClickListener() {
                     @Override
                     public void onClick(SweetAlertDialog sweetAlertDialog) {
                         sweetAlertDialog.dismiss();
                     }
                 });
         sweetAlertDialog.setConfirmButton("Так", new SweetAlertDialog.OnSweetClickListener() {
                     @Override
                     public void onClick(SweetAlertDialog sweetAlertDialog) {
                         sweetAlertDialog.dismiss();
                         Intent intent = new Intent(Intent.ACTION_SEND);
                         intent = new Intent(Intent.ACTION_VIEW, Uri.parse("http://www.ntu.edu.ua/universitet/istoriya-universitetu/"));
                         startActivity(intent);
                     }
                 });
         sweetAlertDialog.show();
     }

    private void historyNTU(){
        text = findViewById(R.id.text);
        text.setText("1944 рік – розпорядженням Ради Народних комісарів СРСР № 11.06-р від 7 листопада 1944 року засновано Київський автомобільно-дорожній інститут (КАДІ), з вересня 2000 року – Національний транспортний університет (НТУ).\n" +
                "\n" +
                "В 1944 було створено два факультети – дорожній та механічний для підготовки фахівців з чотирьох спеціальностей: автомобільні дороги, мости, автомобілі та автомобільне господарство, дорожні машини і механізми. Директором КАДІ призначено Даденкова Юрія Миколайовича.\n" +
                "\n" +
                "1954 рік – створено раду по захисту кандидатських дисертацій, а в 1957р. – раду по захисту докторських дисертацій.\n" +
                "\n" +
                "1958 рік – механічний факультет КАДІ перейменовано на автомобільний.\n" +
                "\n" +
                "1959 рік – ректором КАДІ призначено Вериженка Євгена Петровича.\n" +
                "\n" +
                "1964 рік – у КАДІ створено науково-дослідний сектор (у подальшому називався науковою частиною).\n" +
                "\n" +
                "1965 рік – у КАДІ організовано інженерно-економічний факультет.\n" +
                "\n" +
                "1970 рік – у КАДІ починає діяти підготовче відділення.\n" +
                "\n" +
                "1974 рік – засновано Всесоюзний традиційний студентський мотокрос на призи Київського автомобільно-дорожнього інституту.\n" +
                "\n" +
                "1975 рік – створено факультет підвищення кваліфікації.\n" +
                "\n" +
                "1979 рік - 8 січня виходить перший номер газети «Автодорожник» . За 12 років першого життя газети вийшло 452 номери. З 1991 по 2002 рік «Автодорожник» не виходив. Поновився випуск газети з приходом нового ректора, Дмитриченка М.Ф., – в 2003 році. Кількість номерів «Автодорожника», які вийшли за цей час, вже наближається до 600. В газеті повністю висвітлюється життя університету. Готується кожен номер в першу чергу силами студентів, які розповідають і про навчання і про своє дозвілля, і про відпочинок.\n" +
                "\n" +
                "1984 рік – ректором КАДІ призначено Канарчука Вадима Євгеновича.\n" +
                "\n" +
                "1984 рік – інженерно-економічний факультет КАДІ реорганізовано у факультет економіки та експлуатації автомобільного транспорту.\n" +
                "\n" +
                "1985 рік – у КАДІ організовано заочний факультет.\n" +
                "\n" +
                "1987 рік – автомобільний факультет КАДІ реорганізовано в автомеханічний.\n" +
                "\n" +
                "1990 рік – у КАДІ організовано загальноінженерний факультет.\n" +
                "\n" +
                "1992 рік – на базі факультетів підвищення кваліфікації КАДІ створено факультет післядипломної освіти.\n" +
                "\n" +
                "1992 рік – розпочинається діяльність освітнього комплексу у складі КАДІ автомобільно-дорожніх, автотранспортних технікумів (коледжів) та технікумів транспортного будівництва України.\n" +
                "\n" +
                "1993 рік – факультет економіки та експлуатації автомобільного транспорту перейменовано на факультет управління на транспорті.\n" +
                "\n" +
                "1994 рік, серпень – після державної акредитації КАДІ отримує статус технічного університету, найвищий – ІV рівень акредитації і назву Український транспортний університет (УТУ).\n" +
                "\n" +
                "1998 рік – на базі підготовчого відділення та підготовчих курсів створено факультет довузівської підготовки.\n" +
                "\n" +
                "1999 рік – на базі факультету післядипломної освіти створено Інститут економіки і бізнесу на транспорті УТУ.\n" +
                "\n" +
                "2000 рік – УТУ отримує статус національного і теперішню назву – Національний транспортний університет (НТУ).\n" +
                "\n" +
                "2000 рік – на базі наукової частини створено Науково-дослідний інститут “Проблем транспорту і будівельних технологій”.\n" +
                "\n" +
                "За період роботи НДІ було виконано більше 85 науково-дослідних робіт, фінансування яких здійснювалось за рахунок державного бюджету із загальним обсягом фінансування – понад 12517,488 тис.грн., а також більше 495 госпдоговірних робіт із загальним обсягом фінансування – понад 27626,160 тис. грн.\n" +
                "\n" +
                "За роки роботи НДІ було впроваджено 405 розробок. Авторами розробок отримано охоронних документів загальною кількістю 321 шт, більше 15 тис. студентів взяли участь у виконанні НДР. За результатами виконаних досліджень тільки з 2005 року успішно захищено 111 кандидатських дисертацій та 9 докторських.\n" +
                "\n" +
                "2000 рік – входження до складу Національного транспортного університету Львівського навчально – консультаційного центру 4 рівня акредитації\n" +
                "\n" +
                "2003 рік – ректором НТУ призначено професора Дмитриченка Миколу Федоровича, обраного конференцією трудового колективу університету.\n" +
                "\n" +
                "2003 рік – рішенням Вченої ради університету від 1 жовтня 2003 року на базі заочного факультету НТУ створено Інститут заочного та дистанційного навчання НТУ.\n" +
                "\n" +
                "2003 рік – 21 жовтня 2003 року наказом ректора НТУ №338 на базі інженерного центру інформаційних технологій НТУ створено Міжнародний освітянський центр інформаційних технологій (МОЦІТ).\n" +
                "\n" +
                "2003 рік – університет знову визнано акредитованим за статусом вищого закладу освіти ІV рівня.\n" +
                "\n" +
                "2004 рік – факультет довузівської підготовки НТУ реорганізовано в Інститут доуніверситетської підготовки і міжнародного співробітництва НТУ.\n" +
                "\n" +
                "2004 рік – в травні 2004 р. на кафедрі дорожньо-будівельних матеріалів і хімії було створено науково-дослідну лабораторію “Технологія матеріалів і конструкцій транспортного будівництва імені професора Сюньї Г.К.»\n" +
                "\n" +
                "Основні напрямки діяльності лабораторії спрямовані на розробку і впровадження нових довговічних матеріалів для автомобільних доріг, мостів і аеродромів.\n" +
                "\n" +
                "2004 рік – входження до складу Національного транспортного університету Надвірнянського коледжу 1 рівня акредитації та Барського автомобільно-дорожнього технікуму 1 рівня акредитації.\n" +
                "\n" +
                "2005 рік – Лауреатами державної премії України в галузі науки і техніки стали 5 провідних учених університету.\n" +
                "\n" +
                "2005 рік – університет затверджений координатором проектів TEMPUS TASIS. Зараз університет бере участь в 20 міжнародних договорах про співробітництво. До виконання проектів залучено 29 зарубіжних ВНЗ.\n" +
                "\n" +
                "2005 рік – університет нагороджено дипломом «Лідер транспортного комплексу України».\n" +
                "\n" +
                "2005 рік – згідно рішення Вченої ради НТУ лабораторії «Гідравліки» кафедри мостів та тунелів присвоєно ім?я професора Даденкова Ю.М.\n" +
                "\n" +
                "2006 рік – створення Криворізького навчально – консультаційного центру 4 рівня акредитації.\n" +
                "\n" +
                "2006 рік – з метою підвищення якості підготовки фахівців згідно з наказом № 282 “Про реорганізацію факультетів” у липні 2006 року було створено нові факультети:\n" +
                "-Економіки, менеджменту і права;\n" +
                "-Транспортних та інформаційних технологій.\n" +
                "\n" +
                "2007 рік – відкрито Навчально-консультаційний центр НТУ у м. Івано-Франківськ\n" +
                "\n" +
                "2010 рік – Національний транспортний університет отримав в м.Болонья (Італія) сертифікат про приєднання до Великої Хартії Університетів.\n" +
                "\n" +
                "2012 рік – укладена перша угода про співробітників між корпорацією ЄВРОКАР і НТУ. Згідно угод на виробництві створено 4 науково-виробничих комплекси і 35 філій кафедр.\n" +
                "\n" +
                "2012 рік – до Національного транспортного університету було приєднано Львівське вище професійне училище транспортних технологій та сервісу як відокремлений структурний підрозділ.\n" +
                "\n" +
                "2012 рік – НТУ став переможцем Всеукраїнського конкурсу «Винахід – 2011» в номінації «Кращий винахід – 2011».\n" +
                "\n" +
                "2013 рік – комісія Європейського Союзу відзначила Національний транспортний університет високою нагородою «За управління великим партнерством».\n" +
                "\n" +
                "2013 рік на Міжнародній виставці «Сучасні заклади освіти – 2013» НТУ був нагороджений Дипломом ГРАН-ПРІ «Лідер вищої освіти України» в номінації «Міжнародне співробітництво в галузі освіти і науки».\n" +
                "\n" +
                "2013 рік – біля навчально-бібліотечного корпусу по вул.Кіквідзе, 42 відкрито філію Міжнародного освітянського центру університету, де задіяно два мультимедійних комп’ютерних класи на 25 комп’ютерних місць в кожному.\n" +
                "\n" +
                "2013 рік – до НТУ приєднано Київський транспортно-економічний коледж.\n" +
                "\n" +
                "2014 рік – в конкурсі «Винахід року», який проводив Український інститут промислової власності, комплекс винаходів «Робочий орган роторного траншейного екскаватора» отримав перше місце в абсолютний номінації «Кращий винахід року».\n" +
                "\n" +
                "2014 рік – Рада Європейської Асоціації Університетів 24 жовтня 2014 р. прийняла Національний транспортний університет повноправним членом Європейської Асоціації Університетів.\n" +
                "\n" +
                "2014 рік – дорожньо-будівельний факультет реорганізовано в факультет транспортного будівництва.\n" +
                "\n" +
                "2015 рік – на VI міжнародній виставці «Сучасні заклади освіти 2015» (березень 2015р.) НТУ нагороджено Дипломом ГРАН – ПРІ «Лідер вищої освіти України» та Кубком.\n" +
                "\n" +
                "Із заснуванням Київського автомобільно-дорожнього інституту у Києві відновилася підготовка автомобілістів, дорожників та мостобудівників. Ще до 1930 року таких фахівців вже готували на відповідних факультетах Київського політехнічного інституту, а згодом і Київського інституту народного господарства (згодом на їх базі було створено Харківський автомобільно-дорожній інститут та Дніпропетровський інститут інженерів залізничного транспорту).");
    }

    @Override
    public void onBackPressed() {
        super.onBackPressed();
        finish();
    }

         }