package project.enter.shedule;

import android.app.Activity;
import android.content.Intent;
import android.content.SharedPreferences;
import android.os.AsyncTask;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.MenuItem;
import android.view.View;
import android.view.ViewGroup;
import android.widget.CheckBox;
import android.widget.TextView;
import android.widget.Toast;

import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;
import androidx.core.view.GravityCompat;
import androidx.viewpager.widget.ViewPager;

import java.util.ArrayList;
import java.util.List;

import cn.pedant.SweetAlert.SweetAlertDialog;
import project.enter.shedule.SwipeViewPager.Adapter;
import project.enter.shedule.SwipeViewPager.Model;
import project.enter.shedule.db.DBHelpers;
import project.enter.shedule.db.InsertDoneScheduleDate;

public class Setting extends AppCompatActivity  {

    String[] FTIT1 = new String[]{"МС-1-1", "МП-1-1", "ВП-1-1", "КН-1-1", "ІБК-1-1", "ДЗ-1-1", "ПР-1-1", "ПР-1-2"};
    String[] FTIT2 = new String[]{"ТТ-2-1", "ТТ-2-2", "ТТ-2-3", "ТТ-2-4", "ТТ-2-5", "КН-2-1", "Кн-2-2", "ДЗ-2-1", "ПР-2-1", "ПР-2-2"};
    String[] FTIT3 = new String[]{"УТ-3-1", "УТ-3-2", "МП-3-1", "МП-3-2", "МК-3-1", "ОР-3-1", "ТСМ-3-1", "ВП-3-1", "КН-3-1", "ДЗ-3-1"};
    String[] FTIT4 = new String[]{"УТ-4-1", "УТ-4-2", "МП-4-1", "МК-4-1", "ОР-4-1", "ТСМ-4-1", "ВП-4-1", "Кн-4-1", "ДЗ-4-1"};

    String[] FMLT1 = new String[]{"МН-1-1", "МН-1-2", "МН-1-3", "МН-1-4", "ФТ-1-1", "ОА-1-1", "ТР-1-1", "ТР-1-2"};
    String[] FMLT2 = new String[]{"МН-2-1", "МН-2-2", "МН-2-3", "МН-2-4", "МН-2-5", "ФТ-2-1", "ОА-2-1", "ТР-2-1", "ТР-2-2", "ТР-2-3", "ТР-2-4", "ТР-2-5"};
    String[] FMLT3 = new String[]{"ТМ-3-1", "ТМ-3-2", "ТМ-3-3", "МА-3-1", "ЛГ-3-1", "ЛГ-3-2", "ФТ-3-1", "ФТ-3-2", "ОА-3-1", "ТР-3-1", "ТР-3-2"};
    String[] FMLT4 = new String[]{"ТМ-4-1", "ТМ-4-2", "ТМ-4-3", "ЛГ-4-1", "ЛГ-4-2", "ФТ-4-1", "ОА-4-1", "ТР-4-1", "ТР-4-2"};

    String[] FTB1 = new String[]{"БІ-1-1", "ГЗ-1-1", "ГЗ-1-2", "ПТ-1-1", "ГБ-1-1", "СА-1-1", "ТЗ-1-1"};
    String[] FTB2 = new String[]{"БІ-2-1,3", "БІ-2-2,4", "ГЗ-2-1", "ОМ-2-1", "ПТ-2-1", "ГБ-2-1"};
    String[] FTB3 = new String[]{"БД-3-1", "БА-3-1", "МТ-3-1", "ТК-3-1", "ГД-3-1", "ОМ-3-1"};
    String[] FTB4 = new String[]{"БД-4-1", "БД-4-2", "БА-4-1", "МТ-4-1", "ТК-4-1", "ГД-4-1"};

    String[] FEP1 = new String[]{"ТП-1-1", "ТП-1-2", "ТП-1-3", "ЕП-1-1", "ІП-1-1", "ФП-1-1", "ФП-1-2"};
    String[] FEP2 = new String[]{"ТП-2-1", "ТП-2-2", "ТП-2-3", "ЕП-2-1", "Еп-2-2", "ЕП-2-3", "ІП-2-1", "ФП-2-1", "ФП-2-2"};
    String[] FEP3 = new String[]{"ТП-3-1", "ТП-3-2", "Еп-3-1", "УПП-3-1", "МЕ-3-1", "ІП-3-1", "ФП-3-1", "ФП-3-2"};
    String[] FEP4 = new String[]{"ТП-4-1", "ТП-4-2", "ТП-4-3", "ТП-4-4", "ЕП-4-1", "МЕ-4-1", "ІП-4-1", "ФП-4-1", "ФП-4-2"};

    String[][] FTIT1Subject = new String[][]{{"Фізичне виховання", "Комп. тех. та програмув.", "Фізика" , "Іноземна мова", "Вища математика",  "Основи безпеки людини",  "Економічна теорія" , "Політолого-соціол. курс" , "Основи екології"},
            {"Основи безпеки людини","Економічна теорія","Політолого-соціологічний курс","Іноземна мова","Фізика","Вища математика","Основи охорони праці та безпеки людини","Комп. тех. та програмув.","Фізичне виховання","Основи екології"},
            {"Основи екології","Комп. техн. та програмув.","Вища математика","Фізика","Фізичне виховання","Іноземна мова","Основи охорони праці та безпеки людини","Економічна теорія","Основи безпеки людини","Політолого-соцілогічний курс"},
            {"Економічна теорія","Політолого-соціологічний курс","Дискретна математика","Фізичне виховання","Система управління базами даних","Іноземна мова","Офісні інформ. технології","Алгоритмізація та програмування","Вища математика"},
            {"Дискретна математика","Економічна теорія","Політолого-соціологічний курс","Фізичне виховання","Системи управління базами даних","Іноземна мова","Офісні інформаційні технології","Алгоритмізація та програмування","Вища математика"},
            {"Документознавство","Комп'ютерні мережі і телеком.","Іноземна мова","Організація та управління базами даних","Фізичне виховання","Лінгвістичні основи інформації","ООП та безпека людини","Інженерна комп. техніка","Інтернет-технології та ресурси"},
            {"Політолого-соціологічний курс","Офісні інформаційні технології","Системи управління базами даних","Комп. дискретна математика","Комп'ютерна графіка","Фізичне виховання","Іноземна мова","Математичний аналіз","Економічна теорія"},
            {"Політолого-соціологічний курс","Офісні інформаційні технології","Системи управління базами даних","Комп. дискретна математика","Комп'ютерна графіка","Фізичне виховання","Іноземна мова","Математичний аналіз","Економічна теорія"}};
    String[][] FTIT2Subject = new String[][]{{"Загальний курс транспорту","Фізичне виховання","Вантажні перевезення","Сучасні комп. технології","Основи менеджменту","Основи економіки транспорту","Пасажирські перевезення","Основи теорії транспортних процесів і систем","Основи маркетингу"},
            {"Загальний курс транспорту","Фізичне виховання","Вантажні перевезення","Сучасні комп. технології","Основи менеджменту","Основи економіки транспорту","Пасажирські перевезення","Основи теорії транспортних процесів і систем","Основи маркетингу"},
            {"Загальний курс транспорту","Фізичне виховання","Вантажні перевезення","Сучасні комп. технології","Основи менеджменту","Основи економіки транспорту","Пасажирські перевезення","Основи теорії транспортних процесів і систем","Основи маркетингу"},
            {"Загальний курс транспорту","Фізичне виховання","Вантажні перевезення","Сучасні комп. технології","Основи менеджменту","Основи економіки транспорту","Пасажирські перевезення","Основи теорії транспортних процесів і систем","Основи маркетингу"},
            {"Загальний курс транспорту","Фізичне виховання","Вантажні перевезення","Сучасні комп. технології","Основи менеджменту","Основи економіки транспорту","Пасажирські перевезення","Основи теорії транспортних процесів і систем","Основи маркетингу"},
            {"Філософія","Об'єктно-орієнтовне програмування","Чисельні методи","Фізичне виховання","Технології комп. проектування","Основи охорони праці та безпеки людини","Теорія алгоритмів","Комп. схемотехніка","Електротехніка та електроніка"},
            {"Філософія","Об'єктно-орієнтовне програмування","Чисельні методи","Фізичне виховання","Технології комп. проектування","Основи охорони праці та безпеки людини","Теорія алгоритмів","Комп. схемотехніка","Електротехніка та електроніка"},
            {"Державне управління","Організація та управління базами даних","Лінгвіст. основи документознавства","Комп. технології в діловодстві","Діловодство","Правознавство для документознав.","Фізичне виховання","Архівознавство"},
            {"Філософія","Теорія імовірності і математична статистика","Алгоритми та структури даних","Людинно-машинна взаємодія","Професійна практика програмної інженерії","Телекомунікаційні технології","Об'єктно-орієнтовне програмування","Фізичне виховання","Чисельні методи"},
            {"Філософія","Теорія імовірності і математична статистика","Алгоритми та структури даних","Людинно-машинна взаємодія","Професійна практика програмної інженерії","Телекомунікаційні технології","Об'єктно-орієнтовне програмування","Фізичне виховання","Чисельні методи"}};
    String[][] FTIT3Subject = new String[][]{{"Основи організації вантажних робіт","Організація міжнародних автомобільних перевезень","Вантажні перевезення","Пасажирські перевезення","Організація пасажирських автомобільних перевезень","Осн. теорії систем. і управління","Проектування транспортно-складських комплексів"},
            {"Основи організації вантажних робіт","Організація міжнародних автомобільних перевезень","Вантажні перевезення","Пасажирські перевезення","Організація пасажирських автомобільних перевезень","Осн. теорії систем. і управління","Проектування транспортно-складських комплексів"},
            {"Вантажні перевезення","Тарифи і тарифні системи","Пасажирські перевезення","Сучасні комп. технології","Іноземна мова","Комерційна робота на транспорті","Засоби автотранс. і терм. технологій","Основні теорії систем і управління"},
            {"Вантажні перевезення","Тарифи і тарифні системи","Пасажирські перевезення","Сучасні комп. технології","Іноземна мова","Комерційна робота на транспорті","Засоби автотранс. і терм. технологій","Основні теорії систем і управління"},
            {"Пасажирські перевезення","Тарифи і тарифні системи","Основні теорії систем і управління","Засоби автотранс. і терм. технологій","Вантажні перевезення","Сучасні комп. технології","Іноземна мова","Комерційна робота на транспорті"},
            {"Основи теорії транспортного потоку","Пасажирські перевезення","Організація дорож. руху","Технологія наукових досліджень","Основи теорії систем і управління","Техн. засоби ОДР","Вантажні перевезення","Екологічна характеристика схем ОДР"},
            {"Функціональна логістика","Технологія наукових досліджень","Безпека транспорт. діяльності","Вантажні перевезення","Основи теорії систем і управління","Пасажирські перевезення","Транспортні системи міст","Економіка міських перевезень"},
            {"Основи теорії транспортного потоку","Економіка вантажних перевезень","Технологія наукових досліджень","Вантажні перевезення","Основи теорії систем і управління","Пасажирські перевезення","Функціональна логістика","Проетування транс. систем вантажних перевезень"},
            {"WEB-технології та WEB-дизайн","Мат. методи досліджень операцій","Телекомунікаційні технології","Системний аналіз","Комп. технології статобробки","Технології захисту інформації","Організація баз даних та знань","Комп. моделювання в економіці"},
            {"Аналітико-синтет. переробка","Офісні інформаційні технології","Сучасне програм. забезпечення","Приклад. програмн. забезпечення","Основи менеджменту","Синтет. аналіз інформаційних процесів","Інформаційне право"}};
    String[][] FTIT4Subject = new String[][]{{"Глобальні супутникові системи","Проект. тр.-склад. комплексів","Основи фінансів","Іноземна мова","Основи охорони праці","Екологічна оцінка транспортних систем","ПТТС вантажних перевезень","Організація і регулювання ДР","Взаємодія видів транспорту","Ресурсозбер. технології"},
            {"Глобальні супутникові системи","Проект. тр.-склад. комплексів","Основи фінансів","Іноземна мова","Основи охорони праці","Екологічна оцінка транспортних систем","ПТТС вантажних перевезень","Організація і регулювання ДР","Взаємодія видів транспорту","Ресурсозбер. технології"},
            {"Глобальні супутникові системи","Екологічна оцінка трансп. систем","Основи фінансів","Організація міжнародних пасажирських перевезень","Основи охорони праці","Організація і регулювання ДР","Інфраструктура транспорту","Іноземна мова","Організація міжнародних вантажних перевезень","Взаємодія видів транспорту"},
            {"Екологічна оцінка транспортних систем","Основи охорони праці","Глобальні супутникові системи","Основи фінансів","Митний контроль","Митна інфаструктура","Економіка міжн. автоперевезень","Взаємодія видів транспорту","Іноземна мова","Організація і регулювання ДР"},
            {"Технічні засоби ОДР","Основи адаптивного управління ОДР","Системи навігації і зв'язку на транспорті","Основи охорони праці","Організаація ДР","Основи адаптивного управління ДР","Логістика міських трансп. систем","Взаємодія видів транспорту","Дорожні умови та БР","Іноземна мова","Система навігації"},
            {"Безпека транспортної діяльності","Взаємодія видів транспорту","Екологічна безпека міських перевезень","Основи комбінаторного аналізу","Іноземна мова","Функціональна логістика","Системи управл. транспортом","Організація і безпека ДР","Транспортне планування міст"},
            {"Система управління транспортом","Безпека транспортної діяльності","Екологічна безпека вантажних перевезень","Взаємодія вантажних перевезень","Основи комбінаторного аналізу","Іноземна мова","Глобальні супутникові системи","Функціональна логістика","Основи охорони праці","Організація і безпека ДР","Системи навігації"},
            {"Комп. мережі","Основи охорони праці","Техн. розподілених систем","Технологія створення програмних продуктів","Методи та системи штучного інтелекту","Проектування інформаційних систем","Моделювання систем","Управління IT-проектами","Теорія прийняття рішень"},
            {"Захист інформації","WEB-технології та WEB-дизайн","Основи охорони праці","Управління документознавством","Патентознавство","Документ. забезпечення діяльності установи","Інформаційний менеджмент","Теорія і практика реф. діяльності","Інтернет технології та ресурси","","","","","",""}};

    String[][] FMLT1Subject = new String[][]{{"Іноземна мова","Дослідження операцій","Основи логістики","Теорія імовірності і мат. статист.","Політолого-соціологічний курс","Основи охорони праці та безпеки людини","Професійна та корпоративна етика","Фізичне виховання","Державне та регіональне управл.","Макроекономіка","Досл. операцій і методи оптим."},
            {"Іноземна мова","Дослідження операцій","Основи логістики","Теорія імовірності і мат. статист.","Політолого-соціологічний курс","Основи охорони праці та безпеки людини","Професійна та корпоративна етика","Фізичне виховання","Державне та регіональне управл.","Макроекономіка","Досл. операцій і методи оптим."},
            {"Іноземна мова","Дослідження операцій","Основи логістики","Теорія імовірності і мат. статист.","Політолого-соціологічний курс","Основи охорони праці та безпеки людини","Професійна та корпоративна етика","Фізичне виховання","Державне та регіональне управл.","Макроекономіка","Досл. операцій і методи оптим."},
            {"Іноземна мова","Дослідження операцій","Основи логістики","Теорія імовірності і мат. статист.","Політолого-соціологічний курс","Основи охорони праці та безпеки людини","Професійна та корпоративна етика","Фізичне виховання","Державне та регіональне управл.","Макроекономіка","Досл. операцій і методи оптим."},
            {"Фізичне виховання","Теорія імов. і мат. статистика","Вища математика","Іноземна мова","Інформатика","Макроекономіка","Психологія і етика ділового спіл.","Політична економія","Філософія глобальних проблем сучасності","Історія економіка та екон. думки","Екологія"},
            {"Фізичне виховання","Вища математика","Теорія імовірності і мат. статист.","Інформатика","Іноземна мова","Макроекономіка","Психологія і етика ділового спіл.","Екологія","Політична економія","Філософія глобальних проблем сучасності","Історія економіка та екон. думки"},
            {"Основи туризмознавства","Організ. та техн. туристської діяльності","Географія туризму та країн.","Фізичне виховання","Діяльність турист. самодіяльної орг.","Економічна теорія","Організація анімаційної діяльності","Основи філософських знань","Іноземна мова","Всесвітня культура і мистецтво"},
            {"Основи туризмознавства","Організ. та техн. туристської діяльності","Географія туризму та країн.","Фізичне виховання","Діяльність турист. самодіяльної орг.","Економічна теорія","Організація анімаційної діяльності","Основи філософських знань","Іноземна мова","Всесвітня культура і мистецтво"}};
    String[][] FMLT2Subject = new String[][]{{"Господарське та трудове право","Економіка підприємства","Соціальна психологія та конфл.","Облік і аудит","Трансп. системи в логістиці та організація перевезень","Держ. та регіон. управління","Трансп. системи в логістиці","Фізичне виховання","Теорія організації","Фінанси, гроші та кредит"},
            {"Господарське та трудове право","Економіка підприємства","Соціальна психологія та конфл.","Облік і аудит","Трансп. системи в логістиці та організація перевезень","Держ. та регіон. управління","Трансп. системи в логістиці","Фізичне виховання","Теорія організації","Фінанси, гроші та кредит"},
            {"Господарське та трудове право","Економіка підприємства","Соціальна психологія та конфл.","Облік і аудит","Трансп. системи в логістиці та організація перевезень","Держ. та регіон. управління","Трансп. системи в логістиці","Фізичне виховання","Теорія організації","Фінанси, гроші та кредит"},
            {"Господарське та трудове право","Економіка підприємства","Соціальна психологія та конфл.","Облік і аудит","Трансп. системи в логістиці та організація перевезень","Держ. та регіон. управління","Трансп. системи в логістиці","Фізичне виховання","Теорія організації","Фінанси, гроші та кредит"},
            {"Господарське та трудове право","Економіка підприємства","Соціальна психологія та конфл.","Облік і аудит","Трансп. системи в логістиці та організація перевезень","Держ. та регіон. управління","Трансп. системи в логістиці","Фізичне виховання","Теорія організації","Фінанси, гроші та кредит"},
            {"Мікроекономіка","Фінанси","Іноземна мова","Фізичне виховання","Менеджмент","Економетрика","Статистика","Маркетинг"},
            {"Мікроекономіка","Фінанси","Бухгалтерський облік","Іноземна мова","Фізичне виховання","Маркетинг","Економетрика","Менеджмент","Статистика"},
            {"Економіка і ціноутворення в туризмі","Світовий ринок послуг в індустрії","Іноземна мова","Друга іноземна мова","Фізичне виховання","Орг. та технол. готельн. господ.","Соціал. психол. та конфл.","Транспортне забезпечення в туризмі","Економіка підприємства","Менеджмент організації"},
            {"Економіка і ціноутворення в туризмі","Світовий ринок послуг в індустрії","Іноземна мова","Друга іноземна мова","Фізичне виховання","Орг. та технол. готельн. господ.","Соціал. психол. та конфл.","Транспортне забезпечення в туризмі","Економіка підприємства","Менеджмент організації"},
            {"Економіка і ціноутворення в туризмі","Світовий ринок послуг в індустрії","Іноземна мова","Друга іноземна мова","Фізичне виховання","Орг. та технол. готельн. господ.","Соціал. психол. та конфл.","Транспортне забезпечення в туризмі","Економіка підприємства","Менеджмент організації"},
            {"Економіка і ціноутворення в туризмі","Світовий ринок послуг в індустрії","Іноземна мова","Друга іноземна мова","Фізичне виховання","Орг. та технол. готельн. господ.","Соціал. психол. та конфл.","Транспортне забезпечення в туризмі","Економіка підприємства","Менеджмент організації"},
            {"Економіка і ціноутворення в туризмі","Світовий ринок послуг в індустрії","Іноземна мова","Друга іноземна мова","Фізичне виховання","Орг. та технол. готельн. господ.","Соціал. психол. та конфл.","Транспортне забезпечення в туризмі","Економіка підприємства","Менеджмент організації"}};
    String[][] FMLT3Subject = new String[][]{{"Наукова організація та нормування праці","Логістика","Операційний менеджмент","Самоменеджмент","Взаємодія видів транспорту","Аналіз господарської діяльності","Страхування","ЗЕД підприємства","Зовнішньо-економічна діяльність підприємства"},
            {"Наукова організація та нормування праці","Логістика","Операційний менеджмент","Самоменеджмент","Взаємодія видів транспорту","Аналіз господарської діяльності","Страхування","ЗЕД підприємства","Зовнішньо-економічна діяльність підприємства"},
            {"Наукова організація та нормування праці","Логістика","Операційний менеджмент","Самоменеджмент","Взаємодія видів транспорту","Аналіз господарської діяльності","Страхування","ЗЕД підприємства","Зовнішньо-економічна діяльність підприємства"},
            {"Наукова організація та нормування праці","Страхування","Логістика","Операційний менеджмент","Самоменеджмент","Орга-ція технол. сист. автотрансп.","Аналіз господарської діяльності","ЗЕД підприємства","Зовнішньо-економічна діяльність підприємства"},
            {"Операційний менеджмент","Фінанси, гроші і кредит","Управління мат. потоками","Самоменеджмент","Основи охорони праці та безпеки людини","Економетрія","Управління процесами і системами пасаж. перевезень","Облік і аудит","Організація оптової та роздрібної торгівлі"},
            {"Операційний менеджмент","Фінанси, гроші і кредит","Управління мат. потоками","Самоменеджмент","Основи охорони праці та безпеки людини","Економетрія","Управління процесами і системами пасаж. перевезень","Облік і аудит","Організація оптової та роздрібної торгівлі"},
            {"Страхування","Регіональна економіка","Системний аналіз","Податкова система","Банківська система і банківські операції","Бюджетна система","Аналіз господарської діяльності"},
            {"Страхування","Регіональна економіка","Системний аналіз","Податкова система","Банківська система і банківські операції","Бюджетна система","Аналіз господарської діяльності"},
            {"Страхування","Регіональна економіка","Фінансовий облік","Податкова система","Системний аналіз","Звітність підприємства","Аналіз господарської діяльності"},
            {"Організація анімац. діяльності","Маркетинг в туризмі","Операційний менеджмент","Ділова іноземна мова","Основи охорони праці і безпеки людини","Облік і аудит","Організація та технологія ресторанного господарства","Комунікативний менеджмент"},
            {"Організація анімац. діяльності","Маркетинг в туризмі","Операційний менеджмент","Ділова іноземна мова","Основи охорони праці і безпеки людини","Облік і аудит","Організація та технологія ресторанного господарства","Комунікативний менеджмент"}};
    String[][] FMLT4Subject = new String[][]{{"Стратегічне управління","Проектний аналіз","Управління інноваціями","Техніко-економічний аналіз","Управління конфліктами","Управління матеріально-технічним забезп. підприємства","Контролинг","Комунікативний менеджмент","Основи наукових досліджень"},
            {"Стратегічне управління","Проектний аналіз","Управління інноваціями","Техніко-економічний аналіз","Управління конфліктами","Управління матеріально-технічним забезп. підприємства","Контролинг","Комунікативний менеджмент","Основи наукових досліджень"},
            {"Стратегічне управління","Проектний аналіз","Управління інноваціями","Техніко-економічний аналіз","Управління конфліктами","Управління матеріально-технічним забезп. підприємства","Контролинг","Комунікативний менеджмент","Основи наукових досліджень"},
            {"Управління ризиками в логістиці","Контролінг","Управління проектами","Функціональна логістика","Фінанси підприємства","Управління інноваціями","Стратегічне управлінння","Логістичне обслуговування","Зовнішньо-економічна діяльність підприємства"},
            {"Управління ризиками в логістиці","Контролінг","Управління проектами","Функціональна логістика","Фінанси підприємства","Управління інноваціями","Стратегічне управлінння","Логістичне обслуговування","Зовнішньо-економічна діяльність підприємства"},
            {"Основи біржової діяльності","Оподаткування підприємств","Економіка і орган. інновац. діяльності","Організація біржової діяльності","Фінансовий аналіз","Податкова система","Управління витратами на підприєм."},
            {"Основи біржової діяльності","Основи обліку на підприєм.","Інформ. система і технол. в фінансах","Фінансовий аналіз","Облік у банках","Податкова система","Облік і звітність в оподаткуванні"},
            {"Фінансковий менеджмент","Фінансовий менеджмент в туризмі","Підприємництво","Потенціал і розвиток рекреаційних комплексів України","Стратегічне управління в туризмі","Ділова іноземна мова","Туристсько-рекреаційне проектування","Управління діловим видом туризму","Основи наукових досліджень"},
            {"Фінансковий менеджмент","Фінансовий менеджмент в туризмі","Підприємництво","Потенціал і розвиток рекреаційних комплексів України","Стратегічне управління в туризмі","Ділова іноземна мова","Туристсько-рекреаційне проектування","Управління діловим видом туризму","Основи наукових досліджень"}};

    String[][] FTB1Subject = new String[][]{{"Фізика","Хімія","Фізичне виховання","Теоретична механіка","Вища математика","Інженерна графіка","Комп. графіка","Екологія","Інженерна геодезія"},
            {"Геодезія","Електронні геодез. прилади","Топографія","Фізичне виховання","Фізика","Вища математика","Основи екології","Інформатика і програмування"},
            {"Геодезія","Електронні геодез. прилади","Топографія","Фізичне виховання","Фізика","Вища математика","Основи екології","Інформатика і програмування"},
            {"Контент. тех. док. з буд. та управл.","Гроші і кредит","Політолого-соціологічний курс","Фізичне виховання","Вища математика","Філософія","Макроекономіка","Теор. управл. Управління персоналом","Планування підпр. діяльності"},
            {"Комп. графіка","Фізика","Фізичне виховання","Інженерна графіка","Теоретична механіка","Хімія","Вища математика","Екологія","Інженерна геодезія"},
            {"Фізика","Об'єктно-орієнтовне програмування","Диференційні рівняння","Фізичне виховання","Теорія ймовірності і мат. статистика","Чисельні методи","Математичний аналіз","Алгоритмізація та програмування"},
            {"Українська мова","Інженерна геологія","Вища математика","Загальна екологія","Біологія","Основи електротехніки","Фізика","Хімія"}};
    String[][] FTB2Subject = new String[][]{{"Інженерна геологія","Будівельне матеріалознавство","Фізичне виховання","Інженерна геодезія","Планування міст і транспорту","Архітектура будівель і споруд","Водопостачання і водовідведення","Опір матеріалів"},
            {"Інженерна геологія","Будівельне матеріалознавство","Фізичне виховання","Інженерна геодезія","Планування міст і транспорту","Архітектура будівель і споруд","Водопостачання і водовідведення","Опір матеріалів"},
            {"Фотограмметрія та дист. зондування","Екон. оцінювання інж. рішень","Фізичне виховання","Мат. обробка геодез. вимірів","Вища геодезія","Філософія","Вища математика"},
            {"Фотограмметрія та дист. зондування","Екон. оцінювання інж. рішень","Фізичне виховання","Мат. обробка геодез. вимірів","Вища геодезія","Філософія","Вища математика"},
            {"Українська мова","Іноземна мова","Фізичне виховання","Аудит у підприєм. діяльн.","Підприємницьке право","Менеджмент","Міжнародна економіка","Біржова діяльність","Інвестиційний аналіз"},
            {"Інженерна геологія","Будівельне матеріалознавство","Гідрологія та гідрометрія","Філософія","Опір матеріалів","Контент техніч. докумен.","Теплотехніка"}};
    String[][] FTB3Subject = new String[][]{{"Комп. технол. в трансп. буд.","Трансп. споруди на дорогах","Будівельна механіка","Вишукув. та проект. доріг","Технол. будівництва доріг","Будівельні конструкції","Іноземна мова","Економіка будівництва"},
            {"Будівельна механіка","Безпека на транспорті","Технологія будівництва аеродр. доріг","Економіка будівництва","Вишукув. та проект. аероп.","Технологія будівництва аерод.","Будівельні конструкції","Комп. технології в проектуванні аероп."},
            {"Проектування мостів і труб","Будівельна механіка","Буровибух. роб. у підз. будівн.","Безпека та ризики трансп. спор.","Проектування і буд. тун. і метрополій","Економіка будівництва","Будівельні конструкції","Економіка будівництва"},
            {"Будівельна механіка","Технологія виготовлення та застосування буд. мат.","Заповнювачі для бетонів","Орг. хімія та орг. вяжучі","Економіка будівництва","Будівельна механіка","Будівельні конструкції","Проц. і ап. вир. буд. констр."},
            {"Практикум з геодез. приладів","Іноземна мова","Державний земельний кадастр","GPS-технологія","Землевпорядні вишукування","Планув. міст і транспорт","Основи охорони праці"},
            {"Державний земельний кадастр","GPS-технологія","Типологія трансп. споруд","Типологія будівель","Основи охорони праці","Цифрова фотограмметрія","Іноземна мова"}};
    String[][] FTB4Subject = new String[][]{{"Технологія будівництва доріг","Експлуатація автомобільних доріг","Кошторисна справа","Будівництво та експлуатація міських доріг","Філософія","Будівництво малих штучних споруд","Діагностика доріг","Основи автоматизованих і виробничиї процесів в будівництві","Політологія","Правознавство"},
            {"Технологія будівництва доріг","Експлуатація автомобільних доріг","Кошторисна справа","Будівництво та експлуатація міських доріг","Філософія","Будівництво малих штучних споруд","Діагностика доріг","Основи автоматизованих і виробничиї процесів в будівництві","Політологія","Правознавство"},
            {"Технологія будівництва аеродромів","Водовід. та дренаж. сист. аер.","Експлуатація аеродромів","Організація будівництва","Філософія","Механ. і автом. вир. проц.","Основи автом. і вироб. процесів","Кошторисна справа","Експлуатація і реконструкція мост. споруд","Основи охорони праці","Авіаційна безпека","Правознавство"},
            {"Кошторисна справа","Проектування мостів і труб","Філософія","Організація будівництва","Будівництво мостів і труб","Утримання інженер. споруд","Суч. закордонні норми","Експлуатація і реконструкція мост. споруд","Основи охорони праці","Відновлення транспортних споруд","Правознавство","Буровибухові роботи"},
            {"Техніко-економ. аспекти","Асфальтобетон","Проектув. підприєм. в буд. індустрії","Філософія","Основи охорони праці","Організація будівництва","Кошторисна справа","Матер. і техн. земл. полотна","Основи охорони праці","Фіз. хім. мех. буд. матер."},
            {"Кошторисна справа","Метрологія","ГІС інженер. мереж","Інженерні вишукування","Організація і управління виробництвом","Супутникова геодезія","Інвестиційний аналіз","Основи охорони праці","Практ. пит. майнових прав","Оцінка нерухомого майна","Інженерна геодезія","Коштор. справа геодезійних робіт","Фінансово-економічна діяльність"}};



    String[][] FEP1Subject = new String[][]{{"Ораторське мистецтво","Історія держави і права України","Основи філософських знань","Орг. суд. та правоохор. органів","Латинська мова","Конституційне право України","Професійна етика та психологія","Конст. права та обов'язки громадянн","Теорія держави і права","Іноземна мова","Основи інформатики","Основи інформатики і обчислювальної техніка","Фізичне виховання"},
            {"Ораторське мистецтво","Історія держави і права України","Основи філософських знань","Орг. суд. та правоохор. органів","Латинська мова","Конституційне право України","Професійна етика та психологія","Конст. права та обов'язки громадянн","Теорія держави і права","Іноземна мова","Основи інформатики","Основи інформатики і обчислювальної техніка","Фізичне виховання"},
            {"Ораторське мистецтво","Історія держави і права України","Основи філософських знань","Орг. суд. та правоохор. органів","Латинська мова","Конституційне право України","Професійна етика та психологія","Конст. права та обов'язки громадянн","Теорія держави і права","Іноземна мова","Основи інформатики","Основи інформатики і обчислювальної техніка","Фізичне виховання"},
            {"Політична економія","Регіональна економіка","Теорія імовір. і мат. стат.","Фізичне виховання","Іноземна мова","Основи охорони праці та безп. людини","Політолого-соціол. курс","Основи філософ. знань","Правознавство"},
            {"Риторика","Інформатика та обчисл. техніка","Вища математика","Фізика","Іноземна мова","Фізичне виховання","Укр. мова","Екологія","Інженер. та комп. графіка"},
            {"Практ. курс другої іноземної мови","Вступ до пепекладознавства","Фізичне виховання","Основи безпеки людини","Основи менеджменту","Вступ до мовознавства та основи мовної комунікації Суч. укр. мова і укр. література новітніх часів","Сучасна укр. мова"},
            {"Практ. курс другої іноземної мови","Вступ до пепекладознавства","Фізичне виховання","Основи безпеки людини","Основи менеджменту","Вступ до мовознавства та основи мовної комунікації Суч. укр. мова і укр. література новітніх часів","Сучасна укр. мова"}};
    String[][] FEP2Subject = new String[][]{{"Конст. проц. право України","Адміністративне право","Цивільне та сімейне право","Міжнародне право","Кримінальне право","Кримінальний процес","Іноземна мова","Трудове право","Фізичне виховання","Конституційне право"},
            {"Конст. проц. право України","Адміністративне право","Цивільне та сімейне право","Міжнародне право","Кримінальне право","Кримінальний процес","Іноземна мова","Трудове право","Фізичне виховання","Конституційне право"},
            {"Конст. проц. право України","Адміністративне право","Цивільне та сімейне право","Міжнародне право","Кримінальне право","Кримінальний процес","Іноземна мова","Трудове право","Фізичне виховання","Конституційне право"},
            {"Мікроекономіка","Національна економіка","Психологія та профес. етика","Фізичне виховання","Іноземна мова","Економіка підприємства","Психологія та професійна етика","Економетрика","Національна економіка","Господарське право","Економіка підприємства"},
            {"Мікроекономіка","Національна економіка","Психологія та профес. етика","Фізичне виховання","Іноземна мова","Економіка підприємства","Психологія та професійна етика","Економетрика","Національна економіка","Господарське право","Економіка підприємства"},
            {"Мікроекономіка","Національна економіка","Психологія та профес. етика","Фізичне виховання","Іноземна мова","Економіка підприємства","Психологія та професійна етика","Економетрика","Національна економіка","Господарське право","Економіка підприємства"},
            {"ТММ","Гідравліка","Матеріалознавство","Осн. розрах. і констр. транс. маш.","Основи безпеки людини","Осн. надійн. і довготрив. тр. маш.","Метрологія"},
            {"Фізичне виховання","Осн. інформ. та прикл. лінгвіст.","Практ. курс. осн. іноз. мови","Порівн. лексик. англ. та укр. мови","Історія основної іноземної мови","Практ. переклад з основ. іноз. мови","Практичний курс другої іноземної мови"},
            {"Фізичне виховання","Осн. інформ. та прикл. лінгвіст.","Практ. курс. осн. іноз. мови","Порівн. лексик. англ. та укр. мови","Історія основної іноземної мови","Практ. переклад з основ. іноз. мови","Практичний курс другої іноземної мови"}};
    String[][] FEP3Subject = new String[][]{{"Цивільне та сімейне право","Економіка підприємства","Правові основи інвестиційної діяльності","Кримінальне право","Кримінальний процес","Цивільний процес","Трудове право","Основи безпеки людини","Міжнародне приватне право"},
            {"Цивільне та сімейне право","Економіка підприємства","Правові основи інвестиційної діяльності","Кримінальне право","Кримінальний процес","Цивільний процес","Трудове право","Основи безпеки людини","Міжнародне приватне право"},
            {"Стратегія підприємства","Економіка праці і соц. труд. відносини","Оцінка потенціалу підприємства","Статистика","Гроші і кредит","Міжнародна економіка","Страхування"},
            {"Стратегія підприємства","Економіка праці і соц. труд. відносини","Рекрутинг персоналу","Оцінка потенціалу підприємства","Статистика","Гроші і кредит","Міжнародна економіка"},
            {"Стратегія підприємства","Економіка праці і соц. труд. відносини","Оцінка потенціалу підприємства","Статистика","Гроші і кредит","Ділова іноземна мова","Міжнародне економ. право"},
            {"Теорія та методина вихов. робіт","Психологія праці","ТКМ","Відновлення деталей","Деталі машин та основні констр.","Теоретичні основи теплотехніки","Електротехніка, електроніка","Особливості ТО та ремонту автомобілей","Психологія праці"},
            {"Практика перекл. основ. іноз. мови","Практ. курс з другої іноз. мови","Практ. курс з основної інозем. мови","Системи автом. перекладу","Правознавство","Організація перевезень у міжн. сполучень","Основи економ. теорії"},
            {"Практика перекл. основ. іноз. мови","Практ. курс з другої іноз. мови","Практ. курс з основної інозем. мови","Системи автом. перекладу","Правознавство","Організація перевезень у міжн. сполучень","Основи економ. теорії"}};
    String[][] FEP4Subject = new String[][]{{"Юридична клініка","Адміністративне судочинство","Кримінологія та правова статистика","Господарське право","Цивільний процес","Криміналістика","Цивільне та сімейне право","Міжнародний захист прав людини"},
            {"Юридична клініка","Адміністративне судочинство","Кримінологія та правова статистика","Господарське право","Цивільний процес","Криміналістика","Цивільне та сімейне право","Міжнародний захист прав людини"},
            {"Юридична клініка","Адміністративне судочинство","Кримінологія та правова статистика","Господарське право","Цивільний процес","Криміналістика","Цивільне та сімейне право","Міжнародний захист прав людини"},
            {"Юридична клініка","Адміністративне судочинство","Кримінологія та правова статистика","Господарське право","Цивільний процес","Криміналістика","Цивільне та сімейне право","Міжнародний захист прав людини"},
            {"Формув. бізнес. мод. компаній","Економ. і орган. міжн. перевезень","Обгрунт. госп. рішень","Фінанси підприємства","Управління витратами на підприєм.","ЗЕД підприєм.","Планування і контроль на підприєм.","Ділова іноземна мова"},
            {"Фінансовий менеджмент","Економ. і орган. міжн. перевезень","Облік у заруб. країнах","Міжн. економ. діяльність України","Економіка заруб. країн","Міжнародний бізнес","Обгр. госп. рішень","Ділова іноземна мова"},
            {"Ремонт трансп. машин","Основи сертифікації автом.","Теорет.-правові основи освіти","Експлуаційні матеріали","Осн. розв. розрахунку і констр. тр. маш.","Методика проф. навчання","Триботехніка","Автоматизація трансп. машин"},
            {"Стилістика основної іноземної мови","Методика викл. основ. іноземної мови","Політолого-соц. курс","Етика ділового спілкування","Практика перекладу основ. іноз. мови","Практ. курс основ. іноз. мови","Практика перекладу з другої іноз. мови","Практичний курс другої іноз. мови"},
            {"Стилістика основної іноземної мови","Методика викл. основ. іноземної мови","Політолого-соц. курс","Етика ділового спілкування","Практика перекладу основ. іноз. мови","Практ. курс основ. іноз. мови","Практика перекладу з другої іноз. мови","Практичний курс другої іноз. мови"}};


    DBHelpers dbHelpers;


    protected void saveActivityPreferences() {
        SharedPreferences activityPreferences = getSharedPreferences("SaveTypeSchelder", Activity.MODE_PRIVATE);
        SharedPreferences.Editor editor = activityPreferences.edit();
        editor.putString("facylty", faculty );
        editor.putString("course", course );
        editor.putString("group", group );
        editor.apply();
    }

    protected void saveFingeprint() {
        SharedPreferences activityPreferences = getSharedPreferences("saveFingeprint",Activity.MODE_PRIVATE);
        SharedPreferences.Editor editor = activityPreferences.edit();
        editor.putBoolean(  "checkboxFingeprint", checkboxFingeprint.isChecked());
        editor.apply();
    }

    boolean checkboxFingeprintCheck;
    protected void loadFingeprint() {
        SharedPreferences activityPreferences = getSharedPreferences("saveFingeprint",Activity.MODE_PRIVATE);
        checkboxFingeprintCheck = activityPreferences.getBoolean("checkboxFingeprint", false);
        checkboxFingeprint.setChecked(checkboxFingeprintCheck);

    }

    CheckBox checkboxFingeprint;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_setting);

        checkboxFingeprint = findViewById(R.id.checkboxFingeprint);
        loadFingeprint();
        Toolbar toolbar = findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);
        if (getSupportActionBar() != null){
            getSupportActionBar().setDisplayHomeAsUpEnabled(true);
            getSupportActionBar().setDisplayShowHomeEnabled(true);
        }

        dbHelpers = new DBHelpers(this);
        checkboxFingeprint.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkboxFingeprint.isChecked()){
                    checkboxFingeprint.setChecked(true);
                    saveFingeprint();
                }else{
                    checkboxFingeprint.setChecked(false);
                    saveFingeprint();
                }
            }
        });

    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        // handle arrow click here
        if (item.getItemId() == android.R.id.home) {
            finish(); // close this activity and return to preview activity (if there is any)
        }

        return super.onOptionsItemSelected(item);
    }

    @Override
    public void onBackPressed() {
        super.onBackPressed();
        finish();
    }

    public void newSchedule(View view) {
        CreateShedule();
    }

    public void CreateShedule(){
        ViewGroup viewGroup = findViewById(android.R.id.content);

        View dialogView = LayoutInflater.from(this).inflate(R.layout.custom_dialog, viewGroup, false);

        AlertDialog.Builder builder = new AlertDialog.Builder(this);

        builder.setView(dialogView);

        final AlertDialog alertDialog = builder.create();
        alertDialog.setView(dialogView);
        alertDialog.setCancelable(false);
        TextView MainText =  dialogView.findViewById(R.id.MainText);
        TextView ChooseSomething = dialogView.findViewById(R.id.ChooseSomething);
        MainText.setText("");
        ChooseSomething.setText("Виберіть факультет, групу та курс для того, щоб загрузити ваш розклад");
        MainText.setVisibility(View.GONE);

        dialogView.findViewById(R.id.buttonOne).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                //business logic
                alertDialog.dismiss();
                choiseFaculty();

            }
        });
        dialogView.findViewById(R.id.buttonTwo).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                alertDialog.dismiss();
            }
        });
        /*dialogView.findViewById(R.id.buttonTwo).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                alertDialog.dismiss();

            }
        });*/
        alertDialog.show();

    }

    String faculty = "";
    private void choiseFaculty(){
        final CheckBox checkBox1 , checkBox2 , checkBox3, checkBox4 ,checkBox5;
        final TextView text1 , text2, text3 , text4 ,text5 ;

        ViewGroup viewGroup = findViewById(android.R.id.content);
        View dialogView = LayoutInflater.from(Setting.this).inflate(R.layout.custom_dialog_choise_item, viewGroup, false);
        AlertDialog.Builder builder = new AlertDialog.Builder(Setting.this);
        builder.setView(dialogView);
        final AlertDialog alertDialog = builder.create();
        alertDialog.setView(dialogView);
        alertDialog.setCancelable(false);

        checkBox1 = dialogView.findViewById(R.id.checkbox1);
        checkBox2 = dialogView.findViewById(R.id.checkbox2);
        checkBox3 = dialogView.findViewById(R.id.checkbox3);
        checkBox4 = dialogView.findViewById(R.id.checkbox4);
        dialogView.findViewById(R.id.checkbox5).setVisibility(View.GONE);
        text1 = dialogView.findViewById(R.id.text1);
        text2 = dialogView.findViewById(R.id.text2);
        text3 = dialogView.findViewById(R.id.text3);
        text4 = dialogView.findViewById(R.id.text4);
        text5 = dialogView.findViewById(R.id.text5);
        dialogView.findViewById(R.id.text5).setVisibility(View.GONE);

        TextView MainText =  dialogView.findViewById(R.id.MainText);
        TextView ChooseSomething = dialogView.findViewById(R.id.ChooseSomething);
        MainText.setText("Виберіть факультет");
        ChooseSomething.setText("Виберіть курс");
        ChooseSomething.setVisibility(View.GONE);

        setTextItems(text1,text2,text3,text4,text5,"ФТІТ","ФЕП","ФМЛТ","ФТБ","АВ");

        checkBox1.setChecked(true);
        checkBox1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox1.isChecked()){
                    checkBox1.setChecked(true);
                    checkBox2.setChecked(false);
                    checkBox3.setChecked(false);
                    checkBox4.setChecked(false);
                }else {
                    checkBox1.setChecked(false);
                }
            }
        });
        checkBox2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox2.isChecked()){
                    checkBox2.setChecked(true);
                    checkBox1.setChecked(false);
                    checkBox3.setChecked(false);
                    checkBox4.setChecked(false);
                }else {
                    checkBox2.setChecked(false);
                }
            }
        });
        checkBox3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox3.isChecked()){
                    checkBox3.setChecked(true);
                    checkBox2.setChecked(false);
                    checkBox1.setChecked(false);
                    checkBox4.setChecked(false);
                }else {
                    checkBox3.setChecked(false);
                }
            }
        });
        checkBox4.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox4.isChecked()){
                    checkBox4.setChecked(true);
                    checkBox2.setChecked(false);
                    checkBox3.setChecked(false);
                    checkBox1.setChecked(false);
                }else {
                    checkBox4.setChecked(false);
                }
            }
        });
        dialogView.findViewById(R.id.next).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(!checkBox1.isChecked() && !checkBox2.isChecked() && !checkBox3.isChecked() && !checkBox4.isChecked()){
                    Toast.makeText(Setting.this, "Виберіть хоча б щось", Toast.LENGTH_SHORT).show();
                }else{
                    alertDialog.dismiss();

                    if(checkBox1.isChecked()){
                        faculty = text1.getText().toString();
                    }else if(checkBox2.isChecked()){
                        faculty = text2.getText().toString();
                    } else if(checkBox3.isChecked()){
                        faculty = text3.getText().toString();
                    } else if(checkBox4.isChecked()){
                        faculty = text4.getText().toString();
                    }

                    choiseCourse();
                }
            }
        });
        dialogView.findViewById(R.id.back).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                alertDialog.dismiss();
                faculty = "";
                CreateShedule();

            }
        });
        alertDialog.show();
    }

    String course = "";
    private void choiseCourse(){
        final CheckBox checkBox1 , checkBox2 , checkBox3, checkBox4 ,checkBox5;
        final TextView text1 , text2, text3 , text4 ,text5 ;

        ViewGroup viewGroup = findViewById(android.R.id.content);
        View dialogView = LayoutInflater.from(Setting.this).inflate(R.layout.custom_dialog_choise_item, viewGroup, false);
        AlertDialog.Builder builder = new AlertDialog.Builder(Setting.this);
        builder.setView(dialogView);
        final AlertDialog alertDialog = builder.create();
        alertDialog.setView(dialogView);
        alertDialog.setCancelable(false);

        checkBox1 = dialogView.findViewById(R.id.checkbox1);
        checkBox2 = dialogView.findViewById(R.id.checkbox2);
        checkBox3 = dialogView.findViewById(R.id.checkbox3);
        checkBox4 = dialogView.findViewById(R.id.checkbox4);
        checkBox5 = dialogView.findViewById(R.id.checkbox5);
        text1 = dialogView.findViewById(R.id.text1);
        text2 = dialogView.findViewById(R.id.text2);
        text3 = dialogView.findViewById(R.id.text3);
        text4 = dialogView.findViewById(R.id.text4);
        text5 = dialogView.findViewById(R.id.text5);
        setTextItems(text1,text2,text3,text4,text5,"1 курс","2 курс","3 курс","4 курс","5 курс");

        TextView MainText =  dialogView.findViewById(R.id.MainText);
        TextView ChooseSomething = dialogView.findViewById(R.id.ChooseSomething);
        MainText.setText("Виберіть ваш курс");
        ChooseSomething.setText("Виберіть групу");
        ChooseSomething.setVisibility(View.GONE);

        dialogView.findViewById(R.id.checkbox5).setVisibility(View.GONE);
        dialogView.findViewById(R.id.text5).setVisibility(View.GONE);

        checkBox1.setChecked(true);
        checkBox1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox1.isChecked()){
                    checkBox1.setChecked(true);
                    checkBox2.setChecked(false);
                    checkBox3.setChecked(false);
                    checkBox4.setChecked(false);
                }else {
                    checkBox1.setChecked(false);
                }
            }
        });
        checkBox2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox2.isChecked()){
                    checkBox2.setChecked(true);
                    checkBox1.setChecked(false);
                    checkBox3.setChecked(false);
                    checkBox4.setChecked(false);
                }else {
                    checkBox2.setChecked(false);
                }
            }
        });
        checkBox3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox3.isChecked()){
                    checkBox3.setChecked(true);
                    checkBox2.setChecked(false);
                    checkBox1.setChecked(false);
                    checkBox4.setChecked(false);
                }else {
                    checkBox3.setChecked(false);
                }
            }
        });
        checkBox4.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(checkBox4.isChecked()){
                    checkBox4.setChecked(true);
                    checkBox2.setChecked(false);
                    checkBox3.setChecked(false);
                    checkBox1.setChecked(false);
                }else {
                    checkBox4.setChecked(false);
                }
            }
        });
        dialogView.findViewById(R.id.next).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if(!checkBox1.isChecked() && !checkBox2.isChecked() && !checkBox3.isChecked() && !checkBox4.isChecked()){
                    Toast.makeText(Setting.this, "Виберіть хоча б щось", Toast.LENGTH_SHORT).show();
                }else{
                    alertDialog.dismiss();

                    if(checkBox1.isChecked()){
                        course = text1.getText().toString();
                    }else if(checkBox2.isChecked()){
                        course = text2.getText().toString();
                    } else if(checkBox3.isChecked()){
                        course = text3.getText().toString();
                    } else if(checkBox4.isChecked()){
                        course = text4.getText().toString();
                    }
                    choiseGroup();
                }
            }
        });
        dialogView.findViewById(R.id.back).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                alertDialog.dismiss();
                course = "";
                choiseFaculty();

            }
        });
        alertDialog.show();
    }

    String group = "";
    private void choiseGroup(){

        ViewGroup viewGroup = findViewById(android.R.id.content);
        View dialogView = LayoutInflater.from(Setting.this).inflate(R.layout.custom_dialog_spinner, viewGroup, false);
        AlertDialog.Builder builder = new AlertDialog.Builder(Setting.this);
        builder.setView(dialogView);
        final AlertDialog alertDialog = builder.create();
        alertDialog.setView(dialogView);
        alertDialog.setCancelable(false);

        TextView MainText =  dialogView.findViewById(R.id.MainText);
        TextView ChooseSomething = dialogView.findViewById(R.id.ChooseSomething);
        MainText.setText("Виберіть вашу групу");
        ChooseSomething.setText("Виберіть групу");
        ChooseSomething.setVisibility(View.GONE);

        String[] usingList = null;
        String[][] usingListSubject = null;
        if (faculty.equalsIgnoreCase("ФТІТ") && course.equalsIgnoreCase("1 курс")){
            usingList = FTIT1;
            usingListSubject = FTIT1Subject;
        }else  if (faculty.equalsIgnoreCase("ФТІТ") && course.equalsIgnoreCase("2 курс")){
            usingList = FTIT2;
            usingListSubject = FTIT2Subject;
        } else  if (faculty.equalsIgnoreCase("ФТІТ") && course.equalsIgnoreCase("3 курс")){
            usingList = FTIT3;
            usingListSubject = FTIT3Subject;
        } else  if (faculty.equalsIgnoreCase("ФТІТ") && course.equalsIgnoreCase("4 курс")){
            usingList = FTIT4;
            usingListSubject = FTIT4Subject;
        } else  if (faculty.equalsIgnoreCase("ФЕП") && course.equalsIgnoreCase("1 курс")){
            usingList = FEP1;
            usingListSubject = FEP1Subject;
        }else  if (faculty.equalsIgnoreCase("ФЕП") && course.equalsIgnoreCase("2 курс")){
            usingList = FEP2;
            usingListSubject = FEP2Subject;
        } else  if (faculty.equalsIgnoreCase("ФЕП") && course.equalsIgnoreCase("3 курс")){
            usingList = FEP3;
            usingListSubject = FEP3Subject;
        } else  if (faculty.equalsIgnoreCase("ФЕП") && course.equalsIgnoreCase("4 курс")){
            usingList = FEP4;
            usingListSubject = FEP4Subject;
        } else  if (faculty.equalsIgnoreCase("ФМЛТ") && course.equalsIgnoreCase("1 курс")){
            usingList = FMLT1;
            usingListSubject = FMLT1Subject;
        }else  if (faculty.equalsIgnoreCase("ФМЛТ") && course.equalsIgnoreCase("2 курс")){
            usingList = FMLT2;
            usingListSubject = FMLT2Subject;
        } else  if (faculty.equalsIgnoreCase("ФМЛТ") && course.equalsIgnoreCase("3 курс")){
            usingList = FMLT3;
            usingListSubject = FMLT3Subject;
        } else  if (faculty.equalsIgnoreCase("ФМЛТ") && course.equalsIgnoreCase("4 курс")){
            usingList = FMLT4;
            usingListSubject = FMLT4Subject;
        } else  if (faculty.equalsIgnoreCase("ФТБ") && course.equalsIgnoreCase("1 курс")){
            usingList = FTB1;
            usingListSubject = FTB1Subject;
        }else  if (faculty.equalsIgnoreCase("ФТБ") && course.equalsIgnoreCase("2 курс")){
            usingList = FTB2;
            usingListSubject = FTB2Subject;
        } else  if (faculty.equalsIgnoreCase("ФТБ") && course.equalsIgnoreCase("3 курс")){
            usingList = FTB3;
            usingListSubject = FTB3Subject;
        } else  if (faculty.equalsIgnoreCase("ФТБ") && course.equalsIgnoreCase("4 курс")){
            usingList = FTB4;
            usingListSubject = FTB4Subject;
        }

        String subjects = "";
        models = new ArrayList<>();
        if (usingList != null) {
            for(int i = 0; i < usingList.length; i++){
                subjects = "";
                for (int j = 0; j < usingListSubject[i].length; j ++){
                    subjects += usingListSubject[i][j] + "\n";
                }
                models.add(new Model(usingList[i],subjects));
            }
        }

        adapter = new Adapter(models, this);

        viewPager = dialogView.findViewById(R.id.viewPager);
        viewPager.setAdapter(adapter);
        viewPager.setPadding(80, 0, 80, 0);

        if (usingList != null) {
            group = usingList[0];
        }
        final String[] finalUsingList = usingList;
        viewPager.setOnPageChangeListener(new ViewPager.OnPageChangeListener() {
            @Override
            public void onPageScrolled(int position, float positionOffset, int positionOffsetPixels) {

            }

            @Override
            public void onPageSelected(int position) {
                if (finalUsingList != null) {
                    group = finalUsingList[position];
                }
            }

            @Override
            public void onPageScrollStateChanged(int state) {

            }
        });

        dialogView.findViewById(R.id.next).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                alertDialog.dismiss();

                saveActivityPreferences();

                mt = new MyTask();  //TODO Another Thread for loading BD
                mt.execute();
            }

        });
        dialogView.findViewById(R.id.back).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                alertDialog.dismiss();
                group = "";
                choiseCourse();
            }
        });
        alertDialog.show();
    }

    SweetAlertDialog sweetAlertDialog;
    MyTask mt;
    ViewPager viewPager;
    Adapter adapter;
    List<Model> models;

    private void setTextItems(TextView text1, TextView text2, TextView text3, TextView text4, TextView text5, String s1, String s2, String s3, String s4, String s5){
        text1.setText(s1);
        text2.setText(s2);
        text3.setText(s3);
        text4.setText(s4);
        text5.setText(s5);
    }

    //Another Thread
    private class MyTask extends AsyncTask<Void, Void, Void> {


        public MyTask() {

        }

        @Override
        protected void onPreExecute() {
            super.onPreExecute();

        }

        @Override
        protected Void doInBackground(Void... params) {

            return null;
        }

        @Override
        protected void onPostExecute(Void result) {
            super.onPostExecute(result);
            sweetAlertDialog = new SweetAlertDialog(Setting.this, SweetAlertDialog.SUCCESS_TYPE);
            sweetAlertDialog.setTitleText("Розклад змінено!");
            sweetAlertDialog.setCancelable(false);
            sweetAlertDialog.setConfirmButton("Закрити", new SweetAlertDialog.OnSweetClickListener() {
                @Override
                public void onClick(SweetAlertDialog sweetAlertDialog) {
                    sweetAlertDialog.dismiss();
                    Intent intent = new Intent();
                    intent.putExtra("end","ends");
                    setResult(RESULT_OK,intent);
                    finish();
                }
            });
            sweetAlertDialog.showCancelButton(false);
            sweetAlertDialog.setContentText("\n" + "Ваш факультет - " + faculty + ";\n" + "Ваш курс - " + course + ";\n" + "Ваша група - " + group );
            sweetAlertDialog.show();
        }
    }
}